
#### :building_construction: Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # netbox_vpn_tunnel_group.sites will be created
  + resource "netbox_vpn_tunnel_group" "sites" {
      + id   = (known after apply)
      + name = "site-tunnels"
      + slug = (known after apply)
    }

  # module.device["R10"].netbox_vpn_tunnel.core["CR3"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR3 to R10 (In der Nießdonk)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR3-R10"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R10"].netbox_vpn_tunnel.core["CR4"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR4 to R10 (In der Nießdonk)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR4-R10"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R10"].netbox_vpn_tunnel.core["CR5"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR5 to R10 (In der Nießdonk)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR5-R10"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R10"].netbox_vpn_tunnel_termination.site["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 746
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R10"].netbox_vpn_tunnel_termination.site["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 941
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R10"].netbox_vpn_tunnel_termination.site["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1190
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R14"].netbox_vpn_tunnel.core["CR3"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR3 to R14 (Höherweg)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR3-R14"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R14"].netbox_vpn_tunnel.core["CR4"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR4 to R14 (Höherweg)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR4-R14"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R14"].netbox_vpn_tunnel.core["CR5"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR5 to R14 (Höherweg)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR5-R14"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R14"].netbox_vpn_tunnel_termination.site["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1099
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R14"].netbox_vpn_tunnel_termination.site["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1100
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R14"].netbox_vpn_tunnel_termination.site["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1191
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R15"].netbox_vpn_tunnel.core["CR3"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR3 to R15 (GatherWeg)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR3-R15"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R15"].netbox_vpn_tunnel.core["CR4"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR4 to R15 (GatherWeg)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR4-R15"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R15"].netbox_vpn_tunnel.core["CR5"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR5 to R15 (GatherWeg)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR5-R15"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R15"].netbox_vpn_tunnel_termination.site["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1094
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R15"].netbox_vpn_tunnel_termination.site["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1095
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R15"].netbox_vpn_tunnel_termination.site["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1444
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R18"].netbox_vpn_tunnel.core["CR3"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR3 to R18 (Haus der Jugend)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR3-R18"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R18"].netbox_vpn_tunnel.core["CR4"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR4 to R18 (Haus der Jugend)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR4-R18"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R18"].netbox_vpn_tunnel.core["CR5"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR5 to R18 (Haus der Jugend)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR5-R18"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R18"].netbox_vpn_tunnel_termination.site["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1691
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R18"].netbox_vpn_tunnel_termination.site["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1692
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R18"].netbox_vpn_tunnel_termination.site["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1693
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R19"].netbox_vpn_tunnel.core["CR3"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR3 to R19 (Ariadne)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR3-R19"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R19"].netbox_vpn_tunnel.core["CR4"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR4 to R19 (Ariadne)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR4-R19"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R19"].netbox_vpn_tunnel.core["CR5"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR5 to R19 (Ariadne)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR5-R19"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R19"].netbox_vpn_tunnel_termination.site["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1411
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R19"].netbox_vpn_tunnel_termination.site["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1412
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R19"].netbox_vpn_tunnel_termination.site["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1443
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R20"].netbox_vpn_tunnel.core["CR3"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR3 to R20 (Moskauer Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR3-R20"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R20"].netbox_vpn_tunnel.core["CR4"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR4 to R20 (Moskauer Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR4-R20"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R20"].netbox_vpn_tunnel.core["CR5"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR5 to R20 (Moskauer Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR5-R20"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R20"].netbox_vpn_tunnel_termination.site["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 2005
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R20"].netbox_vpn_tunnel_termination.site["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 2006
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R20"].netbox_vpn_tunnel_termination.site["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 2004
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R9"].netbox_vpn_tunnel.core["CR3"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR3 to R9 (Völklinger Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR3-R9"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R9"].netbox_vpn_tunnel.core["CR4"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR4 to R9 (Völklinger Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR4-R9"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R9"].netbox_vpn_tunnel.core["CR5"] will be created
  + resource "netbox_vpn_tunnel" "core" {
      + description     = "Site tunnel from CR5 to R9 (Völklinger Straße)"
      + encapsulation   = "gre"
      + id              = (known after apply)
      + name            = "CR5-R9"
      + status          = "active"
      + tunnel_group_id = (known after apply)
    }

  # module.device["R9"].netbox_vpn_tunnel_termination.site["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 742
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R9"].netbox_vpn_tunnel_termination.site["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 942
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

  # module.device["R9"].netbox_vpn_tunnel_termination.site["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id = 1189
      + id                  = (known after apply)
      + role                = "peer"
      + tunnel_id           = (known after apply)
    }

Plan: 43 to add, 0 to change, 0 to destroy.
```